In [8]:
import os
os.chdir('/Users/maxstclair/Downloads')
print(os.getcwd())

/Users/maxstclair/Downloads

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [36]:
df_duners = pd.read_csv('DS 4002/Project 1/Duners_reviews.csv')
df_brazos = pd.read_csv('DS 4002/Project 1/brazos_reviews.csv')
df_guad = pd.read_csv('DS 4002/Project 1/guad_reviews.csv')
df_monsoon = pd.read_csv('DS 4002/Project 1/monsoon_reviews.csv')
df_oakhart = pd.read_csv('DS 4002/Project 1/oakhart_reviews.csv')
df_petitpois = pd.read_csv('DS 4002/Project 1/petitpois_reviews.csv', encoding="ISO-8859-1")
df_publicfish = pd.read_csv('DS 4002/Project 1/publicfish_reviews.csv')
df_ridley = pd.read_csv('DS 4002/Project 1/ridley_reviews.csv')

In [80]:
df_duners.drop(['Unnamed: 0', 'Unnamed: 1', '(view source)','Cool','Funny','Useful','Author','Author Friends'], axis=1, inplace=True)
df_duners['Date'] = pd.to_datetime(df_duners['Date'], format='%d/%m/%y')
df_duners['Restaurant'] = 'Duners'
df_duners.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2008-08-29,5.0,Love this restaurant. The menu changes in lit...,13.0,Duners
1,2009-03-26,5.0,A daily menu with lots of choices! Food was g...,38.0,Duners

In [84]:
df_brazos.drop(['Unnamed: 0', 'Unnamed: 1', 'Author', 'Cool','Funny','Useful','Author Friends', '(view source)'], axis=1, inplace=True)
df_brazos['Date'] = pd.to_datetime(df_brazos['Date'], format='%d/%m/%y')
df_brazos['Restaurant'] = 'Brazos'
df_brazos.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2016-11-11,4.0,"Alas, I must update my review for Brazos. I am...",315.0,Brazos
1,2017-04-11,2.0,I had received catering from this place a few ...,385.0,Brazos

In [88]:
df_guad.drop(['Unnamed: 0', 'Unnamed: 1', 'Author', 'Cool','Funny','Useful','Author Friends', '(view source)'], axis=1, inplace=True)
df_guad['Date'] = pd.to_datetime(df_guad['Date'], format='%d/%m/%y')
df_guad['Restaurant'] = 'Guad'
df_guad.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2006-08-18,5.0,Not only is this what you want in a local mexi...,25.0,Guad
1,2008-12-17,4.0,Mmmmmmm - Guady's chips and salsa are tasty! I...,44.0,Guad

In [114]:
df_monsoon.drop(['Unnamed: 0', 'Unnamed: 1', 'Date', 'Cool','Funny','Useful','Author Friends', 'Author ID','Location','Profile URL',
                 'Profile Photo','URL'], axis=1, inplace=True)
df_monsoon['Date'] = pd.to_datetime(df_monsoon['Author']).dt.date
df_monsoon.drop(['Author'], axis=1, inplace=True)
df_monsoon['Restaurant'] = 'Monsoon'
df_monsoon = df_monsoon.loc[:, ['Date', 'Rating', 'Message', 'Author Reviews', 'Restaurant']]
df_monsoon.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
1,2016-12-23,4,This place is definitely one of my favorite re...,222,Monsoon
2,2016-12-27,4,Very cute restauraunt. The seating is a bit li...,126,Monsoon

In [120]:
df_oakhart.drop(['Unnamed: 0', 'Unnamed: 1', 'Author', 'Cool','Funny','Useful','Author Friends', '(view source)'], axis=1, inplace=True)
df_oakhart['Date'] = pd.to_datetime(df_oakhart['Date'], format='%d/%m/%y')
df_oakhart['Restaurant'] = 'Oakhart'
df_oakhart.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2015-05-06,4.0,Maybe it was the twinkling lights or the expos...,2041.0,Oakhart
1,2016-02-25,4.0,Service: 5.0/5.0\nFood: 3.5/5.0\nOverall Exper...,56.0,Oakhart

In [124]:
df_petitpois.drop(['Unnamed: 0', 'Unnamed: 1', 'Author', 'Cool','Funny','Useful','Author Friends', '(view source)'], axis=1, inplace=True)
df_petitpois['Date'] = pd.to_datetime(df_petitpois['Date'], format='%d/%m/%y')
df_petitpois['Restaurant'] = 'petitpois'
df_petitpois.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2008-12-29,4,This is an excellent restaurant right on main ...,62,petitpois
1,2009-07-28,4,Ate outside at Petit Pois beside Senator Warne...,53,petitpois

In [128]:
df_publicfish.drop(['Unnamed: 0', 'Unnamed: 1', 'Author', 'Cool','Funny','Useful','Author Friends', '(view source)'], axis=1, inplace=True)
df_publicfish['Date'] = pd.to_datetime(df_publicfish['Date'], format='%d/%m/%y')
df_publicfish['Restaurant'] = 'publicfish'
df_publicfish.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2019-03-11,5.0,The best seafood I have ever had in Charlottes...,211.0,publicfish
1,2019-10-06,5.0,One of my favorite spots in C'Ville! Make sur...,313.0,publicfish

In [132]:
df_ridley.drop(['Unnamed: 0', 'Unnamed: 1', 'Author', 'Cool','Funny','Useful','Author Friends', '(view source)'], axis=1, inplace=True)
df_ridley['Date'] = pd.to_datetime(df_ridley['Date'], format='%d/%m/%y')
df_ridley['Restaurant'] = 'ridley'
df_ridley.head(2)

,Date,Rating,Message,Author Reviews,Restaurant
0,2021-04-10,5.0,This restaurant was such a great find during o...,28.0,ridley
1,2021-04-12,4.0,I enjoyed an excellent brunch a few Sundays ag...,2.0,ridley

In [134]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

# Append df2 to df1
result = pd.concat([df1, df2], ignore_index=True)

print(result)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [140]:
mps_restaurant = pd.concat([df_duners, df_brazos, df_guad, df_monsoon, df_oakhart, df_petitpois, df_publicfish, df_ridley])
mps_restaurant.head()

,Date,Rating,Message,Author Reviews,Restaurant
0,2008-08-29 00:00:00,5.0,Love this restaurant. The menu changes in lit...,13.0,Duners
1,2009-03-26 00:00:00,5.0,A daily menu with lots of choices! Food was g...,38.0,Duners
2,2009-06-05 00:00:00,5.0,Fabulous! I love this place - fantastic food ...,228.0,Duners
3,2009-08-11 00:00:00,5.0,This was a hard decision between 4 and 5 stars...,87.0,Duners
4,2009-09-02 00:00:00,5.0,"With Duner's, it's all about the food. This v...",59.0,Duners

In [143]:
mps_restaurant.to_csv('MPS_restaurant.csv', index = False)